{
  "intents": [
    {
      "tag": "greeting",
      "patterns": ["Salut", "Bonjour", "Hey"],
      "responses": ["Bonjour !", "Salut ! Comment puis-je vous aider aujourd'hui ?"],
      "context_set": "greeting"
    },
    {
      "tag": "tunisia_location",
      "patterns": ["Où se trouve la Tunisie ?", "Quelle est la localisation de la Tunisie ?", "Dans quel pays se trouve la Tunisie ?"],
      "responses": [
        "La Tunisie est située en Afrique du Nord, bordée par l'Algérie à l'ouest, la Libye au sud-est et la mer Méditerranée au nord et à l'est.",
        "La Tunisie est située à l'extrémité nord de l'Afrique, avec une côte le long de la mer Méditerranée."
      ],
      "context_set": "asked_about_tunisia"
    },
    {
      "tag": "ask_about_tunisia",
      "patterns": ["Parlez-moi de la Tunisie", "Comment est la Tunisie ?", "Pouvez-vous me parler de la culture tunisienne ?"],
      "responses": [
        "La Tunisie est connue pour son histoire riche, ses belles plages et sa culture diversifiée.",
        "La culture tunisienne est un mélange d'influences arabes, berbères, françaises et ottomanes."
      ],
      "context_set": "asked_about_tunisia"
    },
    {
      "tag": "tunisian_food",
      "patterns": ["Comment est la cuisine tunisienne ?", "Parlez-moi de la cuisine tunisienne", "Que mangent les gens en Tunisie ?"],
      "responses": [
        "La cuisine tunisienne est célèbre pour des plats comme le couscous, le brik et la harissa.",
        "Les plats tunisiens populaires incluent la chakchouka, la merguez et le lablabi."
      ],
      "context_filter": "asked_about_tunisia",
      "context_set": "tunisian_food"
    },
    {
      "tag": "tunisian_music",
      "patterns": ["Parlez-moi de la musique tunisienne", "Quelle musique est populaire en Tunisie ?", "Quel genre de musique écoutent les Tunisiens ?"],
      "responses": [
        "La musique tunisienne comprend des genres comme le Malouf, qui a des racines andalouses.",
        "La musique populaire en Tunisie inclut également la pop moderne et le raï."
      ],
      "context_filter": "asked_about_tunisia",
      "context_set": "tunisian_music"
    },
    {
      "tag": "tunisian_festivals",
      "patterns": ["Y a-t-il des festivals en Tunisie ?", "Parlez-moi des festivals tunisiens", "Quels festivals célèbrent les Tunisiens ?"],
      "responses": [
        "Les festivals populaires en Tunisie incluent le Festival International de Carthage et le Festival du Sahara à Douz.",
        "Les Tunisiens célèbrent également des fêtes traditionnelles comme l'Aïd el-Fitr et l'Aïd el-Adha."
      ],
      "context_filter": "asked_about_tunisia",
      "context_set": "tunisian_festivals"
    },
    {
      "tag": "follow_up_food",
      "patterns": ["Parlez-moi plus des plats tunisiens", "Quels sont les plats traditionnels tunisiens ?"],
      "responses": [
        "En plus du couscous et du brik, la cuisine tunisienne propose des spécialités comme le tajine, le kefteji et le makroud.",
        "Ne manquez pas d'essayer la street food tunisienne comme le fricassée et le maqluba lors de votre visite !"
      ],
      "context_filter": "tunisian_food",
      "context_set": "asked_about_tunisia"
    },
    {
      "tag": "follow_up_music",
      "patterns": ["Parlez-moi plus de la musique tunisienne", "Pouvez-vous recommander des artistes de musique tunisienne ?", "Quelles sont les chansons tunisiennes populaires ?"],
      "responses": [
        "Parmi les artistes de musique tunisienne renommés, on trouve Emel Mathlouthi, Saber Rebaï et Lotfi Bouchnak.",
        "Les chansons tunisiennes populaires incluent 'Kelmti Horra' par Emel Mathlouthi et 'Sidi Mansour' par Saber Rebaï."
      ],
      "context_filter": "tunisian_music",
      "context_set": "asked_about_tunisia"
    },
    {
      "tag": "follow_up_festivals",
      "patterns": ["Parlez-moi plus des festivals tunisiens", "Quelles sont les dates du Festival International de Carthage ?", "Pouvez-vous donner plus de détails sur le Festival du Sahara à Douz ?"],
      "responses": [
        "Le Festival International de Carthage a généralement lieu en juillet et août, avec une variété de spectacles de musique, de théâtre et de danse.",
        "Le Festival du Sahara à Douz est une célébration culturelle des traditions bédouines et du patrimoine désertique, qui se tient chaque année en décembre."
      ],
      "context_filter": "tunisian_festivals",
      "context_set": "asked_about_tunisia"
    },
    {
      "tag": "switch_topic",
      "patterns": ["Parlez-moi d'autre chose", "Je suis curieux d'autre chose", "Quoi d'autre"],
      "responses": ["Bien sûr ! Qu'est-ce qui vous intéresse ?"],
      "context_set": ""
    },
    {
      "tag": "default_response",
      "patterns": [],
      "responses": ["Je ne comprends pas. Pouvez-vous reformuler ?"],
      "context_set": "out_of_context"
    },
    {
      "tag": "follow_up_food_ingredients",
      "patterns": ["Quels sont les principaux ingrédients utilisés dans les plats tunisiens ?", "Pouvez-vous me parler des épices tunisiennes ?"],
      "responses": ["La cuisine tunisienne incorpore souvent des ingrédients comme l'huile d'olive, le cumin, la coriandre et la harissa.",
                    "Les épices comme la cannelle, le safran et la menthe sont couramment utilisées dans la cuisine tunisienne."],
      "context_filter": "tunisian_food",
      "context_set": "asked_about_tunisia"
    },
    {
      "tag": "cite_des_sciences_presentation",
      "patterns": ["Parlez-moi de la Cité des Sciences à Tunis", "Qu'est-ce que la Cité des Sciences ?", "Pouvez-vous décrire la Cité des Sciences à Tunis ?"],
      "responses": [
        "La Cité des Sciences à Tunis est un centre scientifique et culturel majeur conçu pour promouvoir la connaissance et l'intérêt pour les sciences auprès du grand public. Située à Tunis, la capitale de la Tunisie, elle offre une diversité d'espaces éducatifs et d'activités."
      ],
      "context_set": "asked_about_cite_des_sciences"
    },
    {
      "tag": "cite_des_sciences_activities",
      "patterns": ["Quelles sont les principales activités à la Cité des Sciences ?", "Parlez-moi des activités à la Cité des Sciences à Tunis"],
      "responses": [
        "Les principales activités à la Cité des Sciences à Tunis incluent des espaces d'exposition, une médiathèque, un centre de congrès et un pavillon pour les expositions temporaires."
      ],
      "context_filter": "asked_about_cite_des_sciences",
      "context_set": "cite_des_sciences_activities"
    },
    {
      "tag": "cite_des_sciences_exhibition_spaces",
      "patterns": ["Parlez-moi des espaces d'exposition à la Cité des Sciences", "Comment sont les espaces d'exposition à la Cité des Sciences à Tunis ?"],
      "responses": [
        "Les espaces d'exposition à la Cité des Sciences incluent l'espace 'L'Univers', qui présente divers objets célestes et explique le positionnement du système solaire et de la Terre, et l'espace 'La vie et l'homme', qui offre une vue globale de la vie sur Terre, son histoire, sa diversité et l'évolution humaine."
      ],
      "context_filter": "cite_des_sciences_activities",
      "context_set": "cite_des_sciences_exhibition_spaces"
    },
    {
      "tag": "cite_des_sciences_media_library",
      "patterns": ["Parlez-moi de la médiathèque à la Cité des Sciences", "Quelles installations sont disponibles dans la médiathèque à la Cité des Sciences à Tunis ?"],
      "responses": [
        "La médiathèque vise à assurer une large diffusion de l'information scientifique auprès du public. Elle comprend une section pour enfants, une section pour le grand public et un centre d'accès à l'information avec une salle de formation en informatique, une salle de conférences et un accès gratuit à Internet."
      ],
      "context_filter": "cite_des_sciences_activities",
      "context_set": "cite_des_sciences_media_library"
    },
    {
      "tag": "cite_des_sciences_congress_center",
      "patterns": ["Comment est le centre de congrès à la Cité des Sciences ?", "Parlez-moi du centre de congrès à la Cité des Sciences à Tunis"],
      "responses": [
        "Le centre de congrès à la Cité des Sciences est composé de deux auditoriums et de plusieurs salles de conférence conçues pour accueillir des conférences, des séminaires et des colloques, facilitant les échanges et discussions scientifiques."
      ],
      "context_filter": "cite_des_sciences_activities",
      "context_set": "cite_des_sciences_congress_center"
    },
    {
      "tag": "cite_des_sciences_temporary_exhibitions",
      "patterns": ["Parlez-moi des expositions temporaires à la Cité des Sciences", "Quel genre d'expositions temporaires a lieu à la Cité des Sciences à Tunis ?"],
      "responses": [
        "Le pavillon pour les expositions temporaires accueille deux à trois expositions par an, comme 'Les Dinosaures du Sahara' et 'Math 21'. Il comprend également des expositions permanentes comme 'SIDA' et 'Tous Parents Tous Différents' dans la mezzanine, et des expositions extérieures illustrant les grandes étapes de l'histoire des sciences."
      ],
      "context_filter": "cite_des_sciences_activities",
      "context_set": "cite_des_sciences_temporary_exhibitions"
    }
  ]
}
