{
  "intents": [
    {
      "tag": "greeting",
      "patterns": ["Hi", "Hello", "Hey Freeways"],
      "responses": ["Hello! Welcome to FreeWays ISI.", "Hi there! Are you interested in free software and open source?"],
      "context_set": "greeting"
    },
    {
      "tag": "freeways_location",
      "patterns": ["Where is Freeways ISI located?", "What is the location of Freeways ISI?", "Where can I find Freeways ISI?"],
      "responses": [
        "FreeWays ISI is based at ISI Ariana (Institut Supérieur d’Informatique), Tunisia.",
        "You can find FreeWays ISI at the Higher Institute of Computer Science (ISI) in Ariana, Tunisia."
      ],
      "context_set": "asked_about_freeways"
    },
    {
      "tag": "ask_about_freeways",
      "patterns": ["Tell me about Freeways ISI", "What is Freeways ISI?", "Can you tell me about the Freeways club?"],
      "responses": [
        "FreeWays ISI is a student club at ISI Ariana that promotes the use of free and open source software.",
        "The FreeWays club’s mission is to spread awareness about free software, support open source contributions, and help students, discover open source solutions."
      ],
      "context_set": "asked_about_freeways"
    },
    {
      "tag": "freeways_activities",
      "patterns": ["What does Freeways ISI do?", "What activities does Freeways organize?", "What kind of events are held by Freeways ISI?"],
      "responses": [
        "Freeways has three technical departements which are Robotics departement, problem solving departement, high level programming departement, also we have three non technical departement, HR departement, finance departement and marketing departement, this year we also created a new departement junior departement, which departement do you want to learn about", 
        "FreeWays organizes events such as open days, workshops, and seminars about free software and open source development.",
        "The club hosts technical sessions, collaborative projects, and sometimes partners with other clubs (like IEEE ISI) for events such as robotics competitions."
      ],
      "context_filter": "asked_about_freeways",
      "context_set": "freeways_activities"
    },
    {
      "tag": "freeways_projects",
      "patterns": ["Tell me about Freeways projects", "What projects does Freeways ISI work on?", "Does Freeways have student projects?"],
      "responses": [
        "FreeWays members work on projects like Linux system customization, embedded systems with free software, and developing web tools for the community.",
        "The club encourages students to build open source projects, contribute to existing ones, and collaborate on innovative ideas."
      ],
      "context_filter": "asked_about_freeways",
      "context_set": "freeways_projects"
    },
    {
      "tag": "freeways_partners",
      "patterns": ["Does Freeways collaborate with other clubs?", "Who does Freeways work with?", "Does Freeways partner with other organizations?"],
      "responses": [
        "Yes, FreeWays often collaborates with other ISI clubs like IEEE ISI, Enactus ISI, and Geeks ISI for joint events.",
        "The club also connects with the broader Tunisian free software community to promote open source culture."
      ],
      "context_filter": "asked_about_freeways",
      "context_set": "freeways_partners"
    },
    {
      "tag": "freeways_join",
      "patterns": ["How can I join Freeways?", "Can I become a member of Freeways ISI?", "How do I register in Freeways ISI?"],
      "responses": [
        "You can join FreeWays ISI by contacting the club during recruitment periods at ISI Ariana.",
        "Membership is open to ISI students who are passionate about free software, open source, and community collaboration."
      ],
      "context_set": "freeways_join"
    },
    {
      "tag": "switch_topic",
      "patterns": ["Tell me something else", "I'm curious about something else", "What else"],
      "responses": ["Sure! Do you want to know about FreeWays projects, events, or how to join?"],
      "context_set": ""
    },
    {
      "tag": "default_response",
      "patterns": [],
      "responses": ["I don’t understand. Could you please rephrase your question about FreeWays ISI?"],
      "context_set": "out_of_context"
    }
  ]
}


